Revit 2026 API

# RibbonPanelName Property

---

Gets or sets the name of the RibbonPanel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; set; }
```
```vb
Public Property Name As String
	Get
	Set
```
```cpp
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Name : string with get, set
```

#### Property Value

String

The name will be displayed on the panel if the Text is not set.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace